Repository: seandepagnier/weather_routing_pi
Catalog: po/*.po
Languages: de

source: <Computed>
de: <Berechnet>

source: Weather_Routing
de: Wetter_Routenplanung

source: Start Weather Route
de: Start Wetter-Route

source: End Weather Route
de: Beende Wetter-Route

source: WeatherRouting
de: Wetter-Routenplanung

source: Weather Routing PlugIn by Sean d'Epagnier
de: Wetter-Routenplanung PlugIn von Sean d'Epagnier

source: Weather Routing PlugIn for OpenCPN Provides Weather routing features include: automatic routing subject to various constraints: islands or inverted regions (places we can't go in a boat) optimal speed based on wind and currents boat speed calculation sail/power , great circle route, constrained routes, optimal routing. p
de: Wetter-Routenplanung PlugIn für OpenCPN Wetter-Routenplanung Funktionen umfassen: automatische Routenplanung vorbehaltlich verschiedener Hemmnisse: Inseln oder Landbereiche (wo ein Boot nicht hin kann). Optimale Geschwindigkeit aufgrund Wind und Strömung Berechnung Bootsgeschwindigkeit Segel/Motor , Großkreis-Routenplanung, erzwungene Routen, optimale Routen. p

source: export function not supported for visual studio compiler on windows.
de: Export-Funktion wird nicht für Windows Visual Studio Compiler unterstützt.

source: Weather Routing
de: Wetter-Routenplanung

source: Empty Route, nothing to export
de: Leere Route, nichts zum Exportieren

source: Weather Route
de: Wetter-Route

source: Weather Route Point
de: Wetter-Routenpunkt

source: Failed to load file:
de: Fehler bei Laden Datei:

source: OpenCPN Alert
de: OpenCPN Alarm

source: Failed to obtain grib for timestep
de: Fehler bei Erhalt Grib für Zeitschritt

source: Computation completed, destination reached
de: Berechnungen beendet, Ziel erreicht.

source: Grib Data Failed to contain required information
de: Grib Datenfehler, erhalten nicht geforderte Information

source: Computation completed, destination not reached.
de: Berechnungen beendet, Ziel nicht erreicht.

source: Running
de: Laufend

source: Stopped
de: Gestoppt

source: Initial Plan
de: Startplan

source: Select Polar
de: Wähle Polar

source: OpenCPN Weather Routing Plugin
de: OpenCPN Wetter-Routenplanung Plugin

source: Failed reading csv:
de: Fehler beim Lesen csv:

source: Failed saving boat polar to csv
de: Fehler b. Speichern Boot-Polar zu csv

source: Drag is both frictional and wave based This can be computed based on boat values above then modified manually. With proper settings hull speed will be achieved, but also break into planing mode possible. A value 0 zero means no wake, where 100 is heaviest displacement. This also takes into account the different harmonics of wakes before hull speed is reached, so resulting boat polar may appear bumpy.
de: Widerstand basiert sowohl auf Reibung und auf Wellen Das kann mit höheren Bootswerten berechnet und dann manuell angepaßt werden. Mit richtigen Einstellungen wird Rumpfgeschw. erreicht, aber es ist auch ein Planungsmodus möglich. Ein Wert 0 bedeutet kein Sog, 100 ist die größte Verdrängung. Damit werden auch die verschiedenen Harmonischen des Sogs berücksichtigt, bevor die Rumpfgeschw. erreicht ist. So kann das resultierende Boots-Polar holperig erscheinen.

source: Drag Computation
de: Widerstands-Berechnung

source: New Plan
de: Neuer Plan

source: Cannot edit switch plan since there is no other plan to switch to.
de: Kann Wechsel-Plan nicht editieren, da kein anderer Plan zum Wechseln da ist.

source: Sail Plans
de: Segel-Pläne

source: Cannot add plan with same name as existing plan.
de: Plan kann nicht mit existierendem Namen hinzugefügt werden.

source: Sail Plan
de: Segel-Plan

source: and
de: und

source: Wind Speed >
de: Wind-Geschw. >

source: Wind Speed <
de: Wind-Geschw. <

source: Wind Direction >
de: Wind-Richtung >

source: Wind Direction <
de: Wind-Richtung <

source: Wave Height >
de: Wellenhöhe >

source: Wave Height <
de: Wellenhöhe <

source: Night Time
de: Bei Nacht

source: Day Time
de: Bei Tag

source: switch to
de: wechsle zu

source: Failed to find plan name to switch to in list
de: Kann Plan-Namen in der Wechsel-Liste nicht finden

source: Switch Plan
de: Wechsle Plan

source: Cannot have min and max wind speed
de: Kann min. + max. Windgeschw. nicht verarbeiten

source: Cannot have min and max wind direction
de: Kann min. + max. Windrichtung nicht verarbeiten

source: Cannot have min and max wave height
de: Kann min. + max. Wellenhöhe nicht verarbeiten

source: Cannot make a rule from no options specified.
de: Kann keine Regel ohne Angabe Optionen machen.

source: Cannot make a rule if neither daytime nor nighttime is specified.
de: Kann keine Regel ohne Angabe Bei-Tag oder Bei-Nacht machen.

source: Specify conditions where we should change to a different plan. If conditions change dramatically, then the program will look at the plan we just changed to and see if it needs to change again, so there is only need to specify rules for the next closest plan.
de: Bedingungen angeben, wo zu anderem Plan gewechselt werden soll. Wenn sich Bedingungen stark ändern, prüft Programm den aktuell gewechselten Plan, ob nochmals gewechselt werden muß. Somit müssen nur die Regeln für den nächstliegenden Plan angegeben werden.

source: Failed to load file
de: Fehler bei Laden Datei

source: Failed to read xml file (no OCPWeatherRoutingBoat node)
de: Fehler bei Lesen xml Datei (kein OCPWeatherRoutingBoat Node)

source: Failed to open file:
de: Fehler bei Öffnen Datei:

source: Failed saving file:
de: Fehler bei Speichern Datei:

source: Warning: less than 4 different degree steps specified
de: Warnung: weniger als 4 verschiedene Grad Schritte angegeben

source: Invalid step size, nothing will be done.
de: Ungültige Schritt-Größe, es erfolgt nichts.
